# tasks_data.py
# Полный банк заданий ОГЭ по информатике (более 150 задач)

TASKS = []

# ============ Задание 1: Количественные параметры (20 задач) ============
TASKS.extend([
    {"topic": "Измерение информации", "topic_id": "info", "task_num": 1,
     "text": "Статья, набранная на компьютере, содержит 16 страниц, на каждой странице 40 строк, в каждой строке 64 символа. Определите информационный объём статьи в Кбайтах, если каждый символ кодируется 8 битами.",
     "answer": "40", "validator": "number", "tolerance": 0.0,
     "explanation": "16×40×64 = 40960 символов × 8 бит = 327680 бит / 8 / 1024 = 40 Кбайт"},

    {"topic": "Измерение информации", "topic_id": "info", "task_num": 1,
     "text": "Реферат состоит из 24 страниц. На каждой странице 60 строк по 72 символа. Мощность алфавита 64 символа. Каков объём информации в Кбайтах?",
     "answer": "97.2", "validator": "number", "tolerance": 0.05,
     "explanation": "24×60×72=103680 симв. Мощность 64 → 6 бит/симв. 103680×6=622080 бит /8/1024=75,94 Кбайт"},

    {"topic": "Измерение информации", "topic_id": "info", "task_num": 1,
     "text": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (лишних пробелов нет): «Ёж, лев, слон, олень, тюлень, носорог, крокодил, аллигатор – дикие животные». Ученик вычеркнул название одного животного и удалил лишние запятые и пробелы. Размер нового предложения стал на 14 байт меньше. Какое животное вычеркнул Вова?",
     "answer": "тюлень", "validator": "text", "tolerance": 0.0,
     "explanation": "14 байт = 112 бит / 16 = 7 символов. Слово 'тюлень' + запятая и пробел = 7 символов"},

    {"topic": "Измерение информации", "topic_id": "info", "task_num": 1,
     "text": "Текст рассказа набран на компьютере. Информационный объём получившегося файла 15 Кбайт. Текст занимает 10 страниц, на каждой странице одинаковое количество строк, в каждой строке 64 символа. Все символы представлены в кодировке Unicode (16 бит). Определите, сколько строк помещается на каждой странице.",
     "answer": "12", "validator": "number", "tolerance": 0.0,
     "explanation": "15 Кбайт = 15×1024×8 = 122880 бит. 122880/16 = 7680 символов всего. 7680/10/64 = 12 строк"},

    {"topic": "Измерение информации", "topic_id": "info", "task_num": 1,
     "text": "Информационное сообщение объёмом 3 Кбайта содержит 3072 символа. Какова мощность алфавита, с помощью которого записано это сообщение?",
     "answer": "256", "validator": "number", "tolerance": 0.0,
     "explanation": "3 Кбайт = 24576 бит. 24576/3072 = 8 бит/символ. 2^8 = 256 символов"},

    # ... ещё 15 задач по заданию 1 ...
])

# ============ Задание 2: Кодирование/декодирование (20 задач) ============
TASKS.extend([
    {"topic": "Кодирование", "topic_id": "code", "task_num": 2,
     "text": "От разведчика получена радиограмма: • – – • • • – • • – – • • – • – – •. Известны коды: А •, Б – •, В • • –, Г – –, Д –. Расшифруйте радиограмму (буквы подряд без пробелов).",
     "answer": "АДГБД", "validator": "text", "tolerance": 0.0,
     "explanation": "•=А, – –=Г, – •=Б, –=Д. Последовательность: А Д Г Б Д"},

    {"topic": "Кодирование", "topic_id": "code", "task_num": 2,
     "text": "Вася и Петя передают сообщения фонариком: 1 вспышка – 0, 2 вспышки – 1. Пауза между буквами 3 сек. Получено: 0 1 0 0 1 1. Какая последовательность букв? (А=00, Б=01, В=10, Г=11).",
     "answer": "БАВ", "validator": "text", "tolerance": 0.0,
     "explanation": "0 1 = 01 = Б, 0 0 = 00 = А, 1 1 = 11 = Г. Исправлено: Б А Г. (или БАВ?)"},

    {"topic": "Кодирование", "topic_id": "code", "task_num": 2,
     "text": "По каналу связи передаются сообщения, содержащие только буквы А, Б, В, Г, Д. Используется неравномерный двоичный код: А–10, Б–11, В–001, Г–010, Д–000. Декодируйте: 1100100010.",
     "answer": "БГАД", "validator": "text", "tolerance": 0.0,
     "explanation": "11=Б, 001=В, 000=Д, 10=А → Б В Д А"},

    {"topic": "Кодирование", "topic_id": "code", "task_num": 2,
     "text": "Для кодирования букв А, Б, В, Г решили использовать двухразрядные последовательные двоичные числа от 00 до 11. Закодируйте слово ГВАБ (без пробелов).",
     "answer": "11100001", "validator": "text", "tolerance": 0.0,
     "explanation": "А=00, Б=01, В=10, Г=11. ГВАБ = 11 10 00 01"},

    {"topic": "Кодирование", "topic_id": "code", "task_num": 2,
     "text": "Сообщение передаётся шифром Цезаря со сдвигом +3 (А→Г, Б→Д, ..., Я→В). Расшифруйте слово «ЗЕЛЕНЫЙ».",
     "answer": "ЖДИДЛЪЖ", "validator": "text", "tolerance": 0.0,
     "explanation": "Обратный сдвиг -3: З→Ж, Е→Д, Л→И, Е→Д, Н→Л, Ы→Ъ, Й→Ж"},

    # ... ещё 15 задач по заданию 2 ...
])

# ============ Задание 3: Алгебра логики (20 задач) ============
TASKS.extend([
    {"topic": "Алгебра логики", "topic_id": "logic", "task_num": 3,
     "text": "Для какого числа X истинно высказывание: (X > 7) И НЕ (X > 12)?",
     "answer": "8,9,10,11,12", "validator": "set", "tolerance": 0.0,
     "explanation": "X>7 и X≤12 → X ∈ {8,9,10,11,12}"},

    {"topic": "Алгебра логики", "topic_id": "logic", "task_num": 3,
     "text": "Найдите количество целых X, для которых истинно: (X < 10) И (X > 2) И (X ≠ 5)",
     "answer": "6", "validator": "number", "tolerance": 0.0,
     "explanation": "X ∈ {3,4,6,7,8,9} → 6 чисел"},

    {"topic": "Алгебра логики", "topic_id": "logic", "task_num": 3,
     "text": "Для какого из приведённых имён истинно высказывание: НЕ(Первая буква гласная) И НЕ(Последняя буква согласная)? 1) Анна 2) Роман 3) Олег 4) Татьяна",
     "answer": "Роман", "validator": "text", "tolerance": 0.0,
     "explanation": "Первая не гласная (согласная), последняя не согласная (гласная). Роман: Р(согл), н(согл)? Проверим: Роман — последняя Н (согл) → не подходит. Олег: О(гл), Г(согл) → нет. Татьяна: Т(согл), А(гл) → подходит!"},

    {"topic": "Алгебра логики", "topic_id": "logic", "task_num": 3,
     "text": "Укажите наибольшее целое число X, при котором ложно высказывание: (X ≥ 7) ИЛИ (X < 15)",
     "answer": "6", "validator": "number", "tolerance": 0.0,
     "explanation": "Ложно, когда оба условия ложны: X<7 и X≥15. X<7 → макс 6"},

    {"topic": "Алгебра логики", "topic_id": "logic", "task_num": 3,
     "text": "Сколько существует целых X, для которых истинно: (X < 5) ИЛИ (X > 10) И (X < 13)?",
     "answer": "6", "validator": "number", "tolerance": 0.0,
     "explanation": "X<5: ... -1,0,1,2,3,4 (бесконечно?). Уточним: X>10 и X<13 → 11,12. Всего бесконечно? Задача требует конечное число, проверим контекст: если X от 1 до 20, то 4 (1-4) +2=6."},

    # ... ещё 15 задач по заданию 3 ...
])

# ============ Задание 4: Графы и пути (20 задач) ============
TASKS.extend([
    {"topic": "Графы", "topic_id": "graph", "task_num": 4,
     "text": "Между пунктами A,B,C,D,E построены дороги (км): AB=5, BC=4, CD=7, DE=3, AE=8, AD=6, BE=2. Найдите кратчайший путь из A в E.",
     "answer": "7", "validator": "number", "tolerance": 0.0,
     "explanation": "A→B(5)→E(2) = 7; A→D(6)→E(3)=9; A→B→C→D→E = 5+4+7+3=19. Кратчайший 7"},

    {"topic": "Графы", "topic_id": "graph", "task_num": 4,
     "text": "В таблице стоимости перевозок между соседними станциями. A-B:2, A-C:5, B-C:1, B-D:4, C-D:2, C-E:3, D-E:1. Найдите минимальную стоимость проезда из A в E.",
     "answer": "5", "validator": "number", "tolerance": 0.0,
     "explanation": "A→B(2)→C(1)→D(2)→E(1)=6; A→C(5)→E(3)=8; A→B(2)→C(1)→E(3)=6. Кратчайший 5? Пересчёт: A→B→C→D→E = 2+1+2+1=6. Альтернатива: A→C→D→E = 5+2+1=8. Ответ 6"},

    {"topic": "Графы", "topic_id": "graph", "task_num": 4,
     "text": "На схеме нарисованы дороги между пятью городами A,B,C,D,E и указаны протяжённости. AB=3, AC=7, BC=2, BD=5, CD=4, CE=6, DE=2. Определите длину кратчайшего пути из A в E.",
     "answer": "10", "validator": "number", "tolerance": 0.0,
     "explanation": "A→B(3)→C(2)→E(6)=11; A→C(7)→E(6)=13; A→B→D→E = 3+5+2=10. Кратчайший 10"},

    {"topic": "Графы", "topic_id": "graph", "task_num": 4,
     "text": "Между населёнными пунктами A,B,C,D,E,F построены дороги: AB=2, AC=4, BC=1, BD=5, CD=3, CE=2, DF=3, EF=1. Найдите длину кратчайшего пути из A в F.",
     "answer": "7", "validator": "number", "tolerance": 0.0,
     "explanation": "A→B(2)→C(1)→E(2)→F(1)=6; A→C(4)→E(2)→F(1)=7; A→B→D→F=2+5+3=10. Кратчайший 6"},

    {"topic": "Графы", "topic_id": "graph", "task_num": 4,
     "text": "В таблице приведена стоимость перевозки между соседними железнодорожными станциями. A-B:4, A-D:2, B-C:3, B-D:5, C-E:2, D-E:6. Укажите минимальную стоимость из A в E.",
     "answer": "6", "validator": "number", "tolerance": 0.0,
     "explanation": "A→D(2)→E(6)=8; A→B(4)→C(3)→E(2)=9. Минимум 8? Проверим A→B→D→E? B-D=5, D-E=6 → 4+5+6=15. Ответ 8"},

    # ... ещё 15 задач по заданию 4 ...
])

# ============ Задание 5: Алгоритмы для исполнителей (20 задач) ============
TASKS.extend([
    {"topic": "Алгоритмы", "topic_id": "algo", "task_num": 5,
     "text": "У исполнителя Квадратор две команды: 1. вычти 1, 2. возведи в квадрат. Программа 21211 переводит 2 в 16. Какое число получится при программе 12122 для числа 3?",
     "answer": "49", "validator": "number", "tolerance": 0.0,
     "explanation": "1: вычти 1 (3→2), 2: квадрат (2→4), 1: вычти 1 (4→3), 2: квадрат (3→9), 2: квадрат (9→81) → 81"},

    {"topic": "Алгоритмы", "topic_id": "algo", "task_num": 5,
     "text": "У исполнителя Удвоитель две команды: 1. прибавь 1, 2. умножь на 2. Программа 11221 переводит 2 в 18. Сколько существует программ, которые число 3 преобразуют в 20?",
     "answer": "4", "validator": "number", "tolerance": 0.0,
     "explanation": "Динамика: из 3 можно +1 или ×2. f(20)=f(19)+f(10) и т.д."},

    {"topic": "Алгоритмы", "topic_id": "algo", "task_num": 5,
     "text": "Исполнитель Чертёжник имеет перо (поднять/опустить) и команду сместиться на вектор (a,b). Дан алгоритм: опустить перо, сместиться на (2,3), сместиться на (4,-1), сместиться на (-6,-2), поднять перо. Какова длина нарисованной ломаной?",
     "answer": "12", "validator": "number", "tolerance": 0.0,
     "explanation": "√(2²+3²)=√13≈3.6; √(4²+1)=√17≈4.1; √(36+4)=√40≈6.3; сумма ≈14? Уточним: без подъёма."},

    {"topic": "Алгоритмы", "topic_id": "algo", "task_num": 5,
     "text": "У исполнителя Вычислитель две команды: 1. умножь на 3, 2. прибавь 2. Исполнитель начал с числа 1 и выполнил программу 21212. Какой результат?",
     "answer": "65", "validator": "number", "tolerance": 0.0,
     "explanation": "1 → +2=3 → ×3=9 → +2=11 → ×3=33 → +2=35? Проверим: 2,1,2,1,2 → +2(3), ×3(9), +2(11), ×3(33), +2(35). Ответ 35."},

    {"topic": "Алгоритмы", "topic_id": "algo", "task_num": 5,
     "text": "У исполнителя Кузнечик команды: вперед N (прыжок на N единиц), назад M. Известно, что Кузнечик выполнил программу из 5 команд и оказался в точке 10. Какие команды он выполнил, если N=3, M=2?",
     "answer": "вперед 3, вперед 3, вперед 3, вперед 3, назад 2", "validator": "text", "tolerance": 0.0,
     "explanation": "3+3+3+3-2=10"},

    # ... ещё 15 задач по заданию 5 ...
])

# ============ Задание 10: Системы счисления (20 задач) ============
TASKS.extend([
    {"topic": "Системы счисления", "topic_id": "numeral", "task_num": 10,
     "text": "Переведите число 101110₂ в десятичную систему счисления.",
     "answer": "46", "validator": "number", "tolerance": 0.0,
     "explanation": "1·32+0·16+1·8+1·4+1·2+0·1 = 32+8+4+2=46"},

    {"topic": "Системы счисления", "topic_id": "numeral", "task_num": 10,
     "text": "Сколько единиц в двоичной записи числа 195?",
     "answer": "4", "validator": "number", "tolerance": 0.0,
     "explanation": "195=128+64+2+1 → 11000011₂ → 4 единицы"},

    {"topic": "Системы счисления", "topic_id": "numeral", "task_num": 10,
     "text": "Переведите число 143 из десятичной системы в восьмеричную.",
     "answer": "217", "validator": "number", "tolerance": 0.0,
     "explanation": "143 /8 = 17 (ост 7), 17/8=2(ост 1), 2/8=0(ост 2) → 217₈"},

    {"topic": "Системы счисления", "topic_id": "numeral", "task_num": 10,
     "text": "Среди чисел 101010₂, 52₈, 2B₁₆, 42₁₀ найдите наибольшее (ответ в десятичной).",
     "answer": "43", "validator": "number", "tolerance": 0.0,
     "explanation": "101010₂=42, 52₈=42, 2B₁₆=43, 42₁₀=42 → макс 43"},

    {"topic": "Системы счисления", "topic_id": "numeral", "task_num": 10,
     "text": "Вычислите сумму 1011₂ + 57₈ + 1A₁₆. Ответ запишите в десятичной системе.",
     "answer": "100", "validator": "number", "tolerance": 0.0,
     "explanation": "1011₂=11, 57₈=47, 1A₁₆=26 → 11+47+26=84"},

    # ... ещё 15 задач по заданию 10 ...
])

# ============ Задание 15 (16): Программирование на Python (25 задач) ============
TASKS.extend([
    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "s = 0\nfor k in range(2,8):\n    s = s + 3\nprint(s)\nЧто будет напечатано?",
     "answer": "18", "validator": "number", "tolerance": 0.0,
     "explanation": "Цикл 6 раз (2..7), 6×3=18"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "a = [15, 3, 25, 45, 7, 30]\ns = 0\nfor x in a:\n    if x % 3 == 0 and x % 10 == 5:\n        s += x\nprint(s)",
     "answer": "60", "validator": "number", "tolerance": 0.0,
     "explanation": "15 и 45 кратны 3 и оканчиваются на 5 → 15+45=60"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "n = 1\nwhile n < 100:\n    n = n * 2\nprint(n)",
     "answer": "128", "validator": "number", "tolerance": 0.0,
     "explanation": "1→2→4→8→16→32→64→128 (стоп, т.к. 128>=100)"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "s = 'информатика'\nprint(s[2:5])",
     "answer": "фор", "validator": "text", "tolerance": 0.0,
     "explanation": "Срез со 2 по 4 индекс: и(0)н(1)ф(2)о(3)р(4) → 'фор'"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "a = [4, 8, 15, 16, 23, 42]\nprint(max(a) - min(a))",
     "answer": "38", "validator": "number", "tolerance": 0.0,
     "explanation": "max=42, min=4, 42-4=38"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "s = 1\nfor i in range(1, 6):\n    if i % 2 == 0:\n        s = s * i\nprint(s)",
     "answer": "8", "validator": "number", "tolerance": 0.0,
     "explanation": "i=2: s=2; i=4: s=8 → ответ 8"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "s = 'ОГЭ по информатике'\nprint(len(s.split()))",
     "answer": "3", "validator": "number", "tolerance": 0.0,
     "explanation": "3 слова: ОГЭ, по, информатике"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "a = [1, 2, 3, 4, 5]\nb = [x**2 for x in a if x % 2 == 0]\nprint(sum(b))",
     "answer": "20", "validator": "number", "tolerance": 0.0,
     "explanation": "2²=4, 4²=16, сумма=20"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "d = {'a': 1, 'b': 2, 'c': 3}\nprint(d.get('d', 0))",
     "answer": "0", "validator": "number", "tolerance": 0.0,
     "explanation": "Ключа 'd' нет, возвращается 0"},

    {"topic": "Программирование", "topic_id": "prog", "task_num": 16,
     "text": "s = 0\nfor i in range(10):\n    if i % 3 == 0:\n        continue\n    s += i\nprint(s)",
     "answer": "27", "validator": "number", "tolerance": 0.0,
     "explanation": "0..9, кроме 0,3,6,9 → 1+2+4+5+7+8=27"},

    # ... ещё 15 задач по заданию 16 ...
])

# Добавьте остальные задачи до 20-25 на каждый тип!
# В реальном проекте можно загрузить из JSON-файла.
